Cases/container/container_template_new/constant/airInside/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0 0);
        emissivity      (0 0);
    };
}

airInside_to_box
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.9 0.9);
        emissivity      (0.9 0.9);
    };
}

container
{
    type        opaqueDiffusive;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.6 0.6);
        emissivity      (0.6 0.6);
    };
}

bottom
{
    type        opaqueDiffusive;

    // Fraction of the reflected is diffussive
    //fd          0.0; // 0: all specular 1: all diffusive
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.6 0.6);
        emissivity      (0.6 0.6);
    };
}

// ************************************************************************* //
