Cases/container/container_template_new/0.org/carrier/qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    carrier
    {
        type            greyDiffusiveRadiationViewFactor;
        emissivityMode  solidRadiation;
        emissivity      uniform 0.6;
        qro             uniform 0;
        value           uniform 0;
    }
    carrier_to_airInside
    {
        type            greyDiffusiveRadiationViewFactor;
        emissivityMode  solidRadiation;
        emissivity      uniform 0.6;
        qro             uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
